CFD_Code-in-progress/OpenFoamFiles/0/U
/*--------------------------------*- C++ -*----------------------------------*\
=========                 |
\\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
\\    /   O peration     | Website:  https://openfoam.org
\\  /    A nd           | Version:  9
\\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
format      ascii;
class       volVectorField;
location    "0";
object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

swimmerVelocity -0.0;

boundaryField
{
//- Set patchGroups for constraint patches
#includeEtc "caseDicts/setConstraintTypes"

outlet
{
type            fixedValue;
value           uniform (0 $swimmerVelocity 0);
}

inlet
{
type            zeroGradient;
//type            inletOutlet;
//inletValue      uniform (0 0 0);
//value           uniform (0 0 0);
}

outerCylinder
{
//type            noSlip;
type            fixedValue;
value           uniform (0 $swimmerVelocity 0);
}

"propeller.*"
{
type            movingWallVelocity;
value           uniform (0 0 0);
}
}


// ************************************************************************* //
